title: Domains
description: Use this section to define Domains settings.
payload:
  payloadtype: com.apple.domains
  supportedOS:
    iOS:
      introduced: '8.0'
      multiple: false
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.10'
      multiple: false
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '2.0'
      multiple: false
      supervised: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    watchOS:
      introduced: n/a
  content: This payload defines web domains that are under an enterprise's management.
payloadkeys:
- key: EmailDomains
  title: Email Domains
  type: <array>
  presence: optional
  content: |-
    An array of domains. The system considers email addresses that lack a suffix matching any of these strings out of domain and marked in Mail.
    Available in iOS 8 and later and macOS 10.10 and later.
  subkeys:
  - key: EmailDomainsItem
    type: <string>
    presence: required
    content: An email address.
- key: WebDomains
  title: Web Domains
  supportedOS:
    macOS:
      introduced: n/a
  type: <array>
  presence: optional
  content: |-
    An array of domains. The system considers URLs matching the patterns listed in this property managed.
    Available in iOS 9.3 and later.
  subkeys:
  - key: WebDomainsItem
    type: <string>
- key: SafariPasswordAutoFillDomains
  title: Password Autofill Domains
  supportedOS:
    iOS:
      introduced: '9.3'
      supervised: true
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
  type: <array>
  presence: optional
  content: |-
    An array of domains. Users can only save passwords in Safari from URLs matching the patterns listed here. This property doesn't disable the autofill feature itself.
    Supervised devices or Shared iPads need this property to enable saving passwords in Safari.
    Available in iOS 9.3 and later.
  subkeys:
  - key: SafariPasswordAutoFillDomainsItem
    type: <string>
- key: CrossSiteTrackingPreventionRelaxedDomains
  title: Cross-Site Tracking Prevention RelaxedDomains
  supportedOS:
    iOS:
      introduced: '16.2'
      supervised: true
      allowmanualinstall: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '13.1'
      allowmanualinstall: false
  type: <array>
  presence: optional
  content: |-
    An array of up to 10 strings. URLs matching the patterns listed here have relaxed enforcement of cross-site tracking prevention.
    Available in iOS 16.2 and later and macOS 13.1 and later.
  subkeys:
  - key: CrossSiteTrackingPreventionRelaxedDomainItem
    type: <string>
