title: App:Managed
description: Use this configuration to define settings for a managed app.
payload:
  declarationtype: com.apple.configuration.app.managed
  supportedOS:
    iOS:
      introduced: '17.2'
      allowed-enrollments:
      - supervised
      - device
      - user
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  apply: multiple
  beta: true
payloadkeys:
- key: AppStoreID
  title: App Store ID
  type: <string>
  presence: optional
  content: The App Store ID of the managed app. One and only one of 'AppStoreID',
    'BundleID', or 'ManifestURL' must be present.
- key: BundleID
  title: Bundle ID
  type: <string>
  presence: optional
  content: The bundle ID of the managed app. One and only one of 'AppStoreID', 'BundleID',
    or 'ManifestURL' must be present.
- key: ManifestURL
  title: Manifest URL
  type: <string>
  presence: optional
  content: The URL of the manifest for the managed app. The manifest is returned as
    a property list. One and only one of 'AppStoreID', 'BundleID', or 'ManifestURL'
    must be present.
- key: InstallBehavior
  title: Install Behavior
  type: <dictionary>
  presence: optional
  content: A dictionary that describes how and when to install the app.
  subkeys:
  - key: Install
    title: Install
    type: <string>
    presence: optional
    rangelist:
    - Optional
    - Required
    default: Optional
    content: |-
      A string that specifies if the app needs to remain on the device at all times or if the user can freely install and remove it, which is one of the following values:

      * Optional: The user can install and remove the app after the system activates the configuration.
      * Required: The system installs the app after it activates the configuration. The user can't remove the app.

      The system automatically installs apps on supervised devices. Otherwise, the device prompts the user to approve installation of the app.
  - key: License
    title: License
    type: <dictionary>
    presence: optional
    content: A dictionary that describes the app's license.
    subkeys:
    - key: Assignment
      title: Assignment
      type: <string>
      presence: optional
      rangelist:
      - Device
      - User
      content: |-
        Indicates what type of license to use when an App Store app is installed:
        * Device - the license is assigned to the device.
        * User - the license is assigned to the user.
        This key must be present for App Store apps.
    - key: VPPType
      title: VPP Type
      supportedOS:
        iOS:
          removed: '18.0'
        macOS:
          removed: '15.0'
      type: <string>
      presence: optional
      rangelist:
      - Device
      - User
      content: |-
        The type of VPP license that the app uses for installation through the App Store, which is one of the following values:

        * Device: The app has a VPP device license.
        * User: The app has a VPP user license.

        This key needs to be present to install an app through the App Store.
- key: IncludeInBackup
  title: Include in Backup
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', backups contain the app and its data.
- key: Attributes
  title: App Attributes
  supportedOS:
    macOS:
      introduced: n/a
  type: <dictionary>
  presence: optional
  content: A dictionary of values to associate with the app.
  subkeys:
  - key: AssociatedDomains
    title: Associated Domains
    type: <array>
    presence: optional
    content: An array of domain names to associate with the app.
    subkeys:
    - key: Domain
      title: Domain
      type: <string>
      presence: required
      content: A domain to be associated with the app.
  - key: AssociatedDomainsEnableDirectDownloads
    title: Associated Domains Enable Direct Downloads
    type: <boolean>
    presence: optional
    default: false
    content: If 'true', the system enables direct downloads for the 'AssociatedDomains'.
  - key: CellularSliceUUID
    title: Cellular Slice UUID
    type: <string>
    presence: optional
    content: The cellular slice identifier, which can be the data network name (DNN)
      or app category. For DNN, encode the value as “DNN:name”, where “name” is the
      carrier-provided DNN name. For app category, encode the value as “AppCategory:category”,
      where “category” is a carrier-provided string such as “Enterprise1”.
  - key: ContentFilterUUID
    title: Content Filter UUID
    type: <string>
    presence: optional
    content: The UUID of the content filter to associate with the app.
  - key: DNSProxyUUID
    title: DNS Proxy UUID
    type: <string>
    presence: optional
    content: The UUID of the DNS proxy to associate with the app.
  - key: RelayUUID
    title: Relay UUID
    type: <string>
    presence: optional
    content: The UUID of the relay to associate with the app.
  - key: TapToPayScreenLock
    title: Tap to Pay Screen Lock
    type: <boolean>
    presence: optional
    default: false
    content: If 'true', the device automatically locks after every transaction that
      requires a customer's card PIN. If 'false', the user can choose the behavior.
  - key: VPNUUID
    title: VPN UUID
    type: <string>
    presence: optional
    content: The UUID of the VPN to associate with the app.
related-status-items:
- status-items:
  - app.managed.list
  note: Each configuration will have a corresponding status item.
